app/Team.php

select * from `sports` where `sports`.`id` = 1 limit 1
---
    public function isComplete(){
        if ($this->participants()->count() >= $this->sport->max_participant) return true;

select * from `sports` where `sports`.`id` = 1 limit 1
---
    public function isValid(){
        if ($this->participants()->count() >= $this->sport->min_participant) return true;