app/Http/Controllers/EventController.php

select * from `events`
---
    public function index(Request $request) {

        $events = Event::all()->sortByDesc("id");