app/Http/Controllers/TournamentController.php

select * from `tournaments`
---
    public function index()
    {
        $tournaments = Tournament::all()->sortBy("start_date");

select * from `pools` where `pools`.`tournament_id` = 1 and `pools`.`tournament_id` is not null
---
    public function show(Request $request, $id)
    {
        $tournament = Tournament::find($id);

        if ($request->ajax())
        {
            // Check if the tornament is Full, no more teams are accepted
            if ($request->input("isFull") == "isFull") {
                if (($tournament->isComplete()) || ($tournament == null)) return 1;
                else return 0;
            }
        }

        $pools = $tournament->pools;
        $totalStage = 0;
        foreach ($pools as $pool) {
            if($pool->stage > $totalStage){
                $totalStage = $pool->stage;
            }
        }
        $tournament =  Tournament::find($id);