app/Http/Controllers/Admin/ParticipantController.php

    public function index()
    {
        $participants = Participant::all();
---
select * from `participants`