app/Http/Controllers/Admin/SportController.php

select * from `sports`
---
    public function index()
    {
        $sports = Sport::all();