app/Http/Controllers/Admin/TeamController.php

    public function index()
    {
        $teams = Team::all();
---
select * from `teams`