app/Http/Controllers/Admin/TournamentPoolController.php

    public function index(Request $request, $id)
    {
        $tournament = Tournament::find($id);

        if ($request->ajax())
        {
            // Check if the tornament is Full, no more teams are accepted
            if ($request->input("isFull") == "isFull") {
                if (($tournament->isComplete()) || ($tournament == null)) return 1;
                else return 0;
            }
        }

        $pools = $tournament->pools;
        $totalStage = 0;
        foreach ($pools as $pool) {
            if($pool->stage > $totalStage){
                $totalStage = $pool->stage;
            }
        }

        $poolModes = PoolMode::all();
        return view('pool.index')->with('pools', $poolModes)
                                    ->with('tournament', $tournament)
                                    ->with('pools', $pools)
                                    ->with('totalStage', $totalStage);
---
select * from `pool_modes`
select * from `pools` where `pools`.`tournament_id` = 1 and `pools`.`tournament_id` is not null

    public function store(Request $request)
    {
        $pool = new Pool;
        $pool->poolName = "$request->poolName";
        $pool->stage = $request->stage;
        $pool->poolSize = $request->pool;
        $pool->isFinished = $request->isFinished;
        $pool->tournament_id = request()->route()->parameters['tournament'];
        $pool->mode_id = 1;
        $pool->game_type_id = 1;
        $pool->save();
---
insert into `pools` (`poolName`, `stage`, `poolSize`, `isFinished`, `tournament_id`, `mode_id`, `game_type_id`) values ('Game1', '2', '2', '0', '1', 1, 1)