app/Http/Controllers/Admin/TournamentPoolController.php

select * from `pools` where `tournament_id` = '1'
---
    public function index()
    {
        $poolModes = PoolMode::all();
        return view('pool.index')->with('pools', $poolModes);